# Some Useful Methods in Pandas

In [3]:
import pandas as pd
import numpy as np

In [4]:
data = {'Category': ['A', 'B', 'A', 'C', 'B', 'A', 'A', 'C']}
df = pd.DataFrame(data)

In [5]:
df.head(10)

  Category
0        A
1        B
2        A
3        C
4        B
5        A
6        A
7        C

In [10]:
df['Category'].unique()
# unique values in the column!

array(['A', 'B', 'C'], dtype=object)

In [11]:
df['Category'].nunique()
# no. of unique values in the column!

3

In [21]:
df['Category'].value_counts()
# frequency of values!

Category
A    4
B    2
C    2
Name: count, dtype: int64

In [22]:
data = {'Category': ['A', 'B', 'A', 'C', 'B', 'A', 'A', 'C'],
        'Value': [10, 20, 15, 25, 30, 12, 18, 22],
         "Value2": [11, 21, 25, 35, 40, 18, 11, 42]}
df = pd.DataFrame(data)

In [23]:
df.head()

  Category  Value  Value2
0        A     10      11
1        B     20      21
2        A     15      25
3        C     25      35
4        B     30      40

In [24]:
df.columns

Index(['Category', 'Value', 'Value2'], dtype='object')

In [25]:
df.info()
# general information about the dataframe!

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Category  8 non-null      object
 1   Value     8 non-null      int64
 2   Value2    8 non-null      int64
dtypes: int64(2), object(1)
memory usage: 320.0+ bytes

In [28]:
df.describe()
# statistical features of all numerical column in df!

           Value     Value2
count   8.000000   8.000000
mean   19.000000  25.375000
std     6.697548  12.362819
min    10.000000  11.000000
25%    14.250000  16.250000
50%    19.000000  23.000000
75%    22.750000  36.250000
max    30.000000  42.000000

In [32]:
df.describe().T

        count    mean        std   min    25%   50%    75%   max
Value     8.0  19.000   6.697548  10.0  14.25  19.0  22.75  30.0
Value2    8.0  25.375  12.362819  11.0  16.25  23.0  36.25  42.0

In [33]:
df.dtypes

Category    object
Value        int64
Value2       int64
dtype: object

In [34]:
data = {'Value': [10, 20, 25, 25],
         "Value2": [11, 21, 25, 25]}
df = pd.DataFrame(data)

In [35]:
df

   Value  Value2
0     10      11
1     20      21
2     25      25
3     25      25

In [36]:
df.drop_duplicates(inplace=True)
df

   Value  Value2
0     10      11
1     20      21
2     25      25

In [37]:
df

   Value  Value2
0     10      11
1     20      21
2     25      25

In [38]:
df.sort_values(by="Value") #ascending!

   Value  Value2
0     10      11
1     20      21
2     25      25

In [40]:
df.sort_values(by="Value",ascending=False)
# its not saved because inplace=True

   Value  Value2
2     25      25
1     20      21
0     10      11

In [43]:
df.sort_values(by="Value",ascending=False,
               ignore_index=True,inplace=True)
df

   Value  Value2
0     25      25
1     20      21
2     10      11

In [44]:
# df.sort_values(by=["",""], ascending=[True,False])
# sort on multiple columns!